<?php

return [

     /* ------------------------------ رسائل التحقق ------------------------------ */
    'username' => [
        'required' => 'اسم المستخدم مطلوب'
    ],
    'password' => [
        'required' => 'كلمة المرور مطلوبة'
    ],
    "required_name_ar" => "اسم بالعربي مطلبوب",
    "required_precent_deducation" => "نسبة الاقتطاع مطلوبة",
    "unique" => "هذا الحقل موجود من قبل, تفقد بيانتك",
    "min_description" => "يجب ان لا يقل عدد الحروف عن 8",
    'string' => '.يجب أن يكون الحقل عبارة سلسلة',
    'email' => 'يجب ان يكون على صيغة ايميل',
    'numeric' => 'يجب ان يكون رقم',
    'exists' => 'هذا الحقل غير مطابق مع البيانات الموجودة',
    'file' => 'هذا الحقل يجب ان يكون ملف',
    'zip' => 'يجب ان يكون على امتداد zip',

    /* --------------------------------- الرسائل -------------------------------- */
    "get_data" => "تم جلب العنصر بنجاح",
    "update_success" =>"تم اضافة العنصر بنجاح",
    "add_success"    =>"تم تعديل على العنصر بنجاح",
    "delete_success" =>"تم حذف العنصر بنجاح",
    "get_all_data" => "جلب العناصر بنجاح",
    // وضع الموقع
    "active_dark_mode" => "لقد تم تغيير الوضع إلى وضع نهاري",
    "disactive_dark_mode" => "لقد تم تغيير الوضع إلى وضع ليلي",

    // المستخدم
    "send_eamil_reset_password" => "لقد تم ارسال رابط استعادة كلمة المرور إلى بريدك الالكتروني",
    "error_verify" => "حدث خطأ ما لم يتم العثور على رمز استعادة كلمة المرور الخاص بك",
    "success_verify_reset_password" => "رمز استعادة كلمة المرور الخاص بك صحيح",
    "success_reset_password" => "لقد تم إعادة تعيين كلمة المرور بنجاح",
    "fieled_operation" => "فشلت العملية",
    "error_login" => "المعلومات التي أدخلتها خاطئة",
    "email_already" => "هذا البريد الالكتروني موجود من قبل",

    // البائع
    "active_product" => "تم تنشيط الخدمة بنجاح",
    "disactive_product" => "تم تعطيل الخدمة بنجاح",
    "disactived_product" => "الخدمة معطلة",
    "actived_product" => "الخدمة منشطة",
    "my_products" => "لقد تم العثور على خدماتك",
    "add_profile_seller" => "تم تسجيل بروفايل البائع بنجاح",
    // الخدمة
    "number_of_products_seller" => "لا يمكن اضافة خدمة فوق عدد الاقصى المحدد لك",
    "success_step_one" => "تم انشاء المرحلة الاولى بنجاح",
    "success_step_two" => "تم انشاء المرحلة الثانية بنجاح",
    "success_step_three" => "تم انشاء المرحلة الثالثة بنجاح",
    "success_step_four" => "تم انشاء المرحلة الرابعة بنجاح",
    "success_step_final" => "تم انهاء المراحل و انشاء الخدمة بنجاح",
    "number_developments_max" => "لا يمكن اضافة تطوير فوق عدد الاقصى المحدد لك",
    "price_development_max" => "لا يمكن اضافة سعر فوق عدد الاقصى المحدد لك",
    "thumbnail_required" => "يجب عليك رفع الصورة الامامية",
    "count_galaries" => "يجب ان يكون عدد الصور المرفوعة لا تزيد عن  5 و لا تقل عن 1",

    /* ------------------------------ رسائل الاخطاء ----------------------------- */
    "error_database" => "هناك خطأ ما حدث في قاعدة بيانات , يرجى التأكد من ذلك",
    "element_not_found" => "لا يوجد هذا العنصر",
    /* ------------------------------- لوحة التحكم ------------------------------ */
    "statistic_dashboard" => "احصائيات لوحة التحكم",
    // تنشيط الخدمة
    "active_status_product" => "تم تنشيط الخدمة بنجاح",
    "reject_status_product" => "تم رفض الخدمة بنجاح",
    // المدير
    "get_login" => "تم تسجيل الدخول بنجاح",
    "get_logout" => "تم تسجيل الخروج بنجاح",
    "valid_login" => "المعلومات التي أدخلتها خاطئة",

];
