<?php

return [

     /* ------------------------------ رسائل التحقق ------------------------------ */
    'username' => [
        'required' => 'اسم المستخدم مطلوب'
    ],
    'password' => [
        'required' => 'كلمة المرور مطلوبة'
    ],
    "validation" => [
        "required_name_ar" => "اسم بالعربي مطلبوب",
        "required_precent_deducation" => "نسبة الاقتطاع مطلوبة",
        "unique" => "هذا الحقل موجود من قبل, تفقد بيانتك",
        "min_description" => "يجب ان لا يقل عدد الحروف عن 8",
        'string' => '.يجب أن يكون الحقل عبارة سلسلة',
        'email' => 'يجب ان يكون على صيغة ايميل',
        'numeric' => 'يجب ان يكون رقم',
        'exists' => 'هذا الحقل غير مطابق مع البيانات الموجودة',
        'file' => 'هذا الحقل يجب ان يكون ملف',
        'zip' => 'يجب ان يكون على امتداد zip',
    ],
    
    /* --------------------------------- الرسائل -------------------------------- */
    // العمليات
    "oprations" => [
        "get_data" => "تم جلب العنصر بنجاح",
        "add_success" =>"تم اضافة العنصر بنجاح",
        "update_success"    =>"تم تعديل على العنصر بنجاح",
        "delete_success" =>"تم حذف العنصر بنجاح",
        "get_all_data" => "جلب العناصر بنجاح",
    ],
    // وضع الموقع
    "mode" => [
        "active_dark_mode" => "لقد تم تغيير الوضع إلى وضع نهاري",
        "disactive_dark_mode" => "لقد تم تغيير الوضع إلى وضع ليلي",
    ],

    // المستخدم
    "user" => [
        "send_eamil_reset_password" => "لقد تم ارسال رابط استعادة كلمة المرور إلى بريدك الالكتروني",
        "error_verify" => "حدث خطأ ما لم يتم العثور على رمز استعادة كلمة المرور الخاص بك",
        "success_verify_reset_password" => "رمز استعادة كلمة المرور الخاص بك صحيح",
        "success_reset_password" => "لقد تم إعادة تعيين كلمة المرور بنجاح",
        "fieled_operation" => "فشلت العملية",
        "error_login" => "المعلومات التي أدخلتها خاطئة",
        "email_already" => "هذا البريد الالكتروني موجود من قبل",
    ],
    // البائع
    "seller" => [
        "active_product" => "تم تنشيط الخدمة بنجاح",
        "disactive_product" => "تم تعطيل الخدمة بنجاح",
        "disactived_product" => "الخدمة معطلة",
        "actived_product" => "الخدمة منشطة",
        "my_products" => "لقد تم العثور على خدماتك",
        "add_profile_seller" => "تم تسجيل بروفايل البائع بنجاح",
    ],
    // الخدمة
    "product" => [
        "number_of_products_seller" => "لا يمكن اضافة خدمة فوق عدد الاقصى المحدد لك",
        "success_step_one" => "تم انشاء المرحلة الاولى بنجاح",
        "success_step_two" => "تم انشاء المرحلة الثانية بنجاح",
        "success_step_three" => "تم انشاء المرحلة الثالثة بنجاح",
        "success_step_four" => "تم انشاء المرحلة الرابعة بنجاح",
        "success_step_final" => "تم انهاء المراحل و انشاء الخدمة بنجاح",
        "number_developments_max" => "لا يمكن اضافة تطوير فوق عدد الاقصى المحدد لك",
        "price_development_max" => "لا يمكن اضافة سعر فوق عدد الاقصى المحدد لك",
        "thumbnail_required" => "يجب عليك رفع الصورة الامامية",
        "count_galaries" => "يجب ان يكون عدد الصور المرفوعة لا تزيد عن  5 و لا تقل عن 1",
    ],
    
    /* ------------------------------ رسائل الاخطاء ----------------------------- */
    "errors" => [
        "error_database" => "هناك خطأ ما حدث في قاعدة بيانات , يرجى التأكد من ذلك",
        "element_not_found" => "لا يوجد هذا العنصر",
        "url_not_found" => "هذا الرابط غير موجود",
    ],
    /* ------------------------------- لوحة التحكم ------------------------------ */
    "dashboard" => [
        "statistic_dashboard" => "احصائيات لوحة التحكم",
        // تنشيط الخدمة
        "active_status_product" => "تم تنشيط الخدمة بنجاح",
        "reject_status_product" => "تم رفض الخدمة بنجاح",
        // المدير
        "get_login" => "تم تسجيل الدخول بنجاح",
        "get_logout" => "تم تسجيل الخروج بنجاح",
        "valid_login" => "المعلومات التي أدخلتها خاطئة",
        "get_product_actived" => "تم العثور على قائمة الخدمات التي تم تنشيطها",
        "get_product_rejected" => "تم العثور على قائمة الخدمات التي تم رفضها",
    ],
    // السلة
    "cart" => [
        "cartitem_found" => "هذا العنصر موجود فالسلة , اضف عنصر آخر",
        "product_not_buying" => "لا يمكنك شراء هذه الخدمة, تفقد بياناتك",
        "same_developments" =>"التطويرات التي تم ادخالها ليست مطابقة مع هذه الخدمة",
        "not_found_cartitem" => "لا توجد سلة غير مباعة , اضف سلة جديدة من فضلك",
        "cart_not_found" => "لا توجد سلة , الرجاء اعادة عملية الشراء",
        "catitem_not_found" => "لا توجد عناصر فالسلة , الرجاء اعادة عملية الشراء"
    ],
    // المعاملة بين البائع و المشتري
    "item" => [
        "not_may_this_operation" => "لا يمكنك اجراء هذه العملية, تفقد بياناتك",
        "not_found_item_reject" => "لا يوجد الطلب الغاء الطلبية",
        "accept_item_by_seller" => "تم قبول الطلب من قبل البائع",
        "reject_item_by_seller" => "تم رفض الطلب من قبل البائع",
        "accept_item_by_buyer" => "تم قبول الطلب من قبل المشتري",
        "reject_item_by_buyer" => "تم رفض الطلب من قبل المشتري",
        "must_be_dilevery_resources" => "يجب عليك رفع المشروع قبل التسليم",
        "dilevery_resources_founded" => "لقد تم تسليم المشروع مسبقا, تفقد بياناتك",
        "dilevery_resources_success" => "تم تسليم المشروع من قبل البائع",
        "resource_uploaded" => "لقد تم رفع الملف من قبل , الان يجب عليك تسليم",
        "resource_upload" => "تم رفع المشروع و تهيئة تسليمه للمشتري",
        "resource_not_found" => "المشروع لا يوجد",
        "resource_rejected" => "حالة مشروع مرفوضة , تفقد بياناتك",
        "resource_not_dilevery" => "لم يتم تسليم المشروع , تفقد بياناتك",
        "resource_dilevered"     => "تم استلام المشروع من قبل المشتري و انهاء المعاملة",
        "resource_accepted"       => "حالة مشروع مقبول , تفقد بياناتك",
        "resource_not_dilevered" => "تم رفض المشروع من قبل المشتري و رفض الطلبية",
        "request_buyer_sended" => "لقد تم ارسال طلب الغاء من قبل المشتري, قم بقبول الغاء الطلب او ارفضه",
        "request_sended" => "لقد تم ارسال طلب الغاء, انتظر حتى يتم القبول او الرفض",
        "request_seller_success" => "تم ارسال طلب الغاء من قبل البائع",
        "request_buyer_success" => "تم ارسال طلب الغاء من قبل المشتري",
        "request_seller_sended" => "لقد تم ارسال طلب الغاء من قبل البائع, قم بقبول الغاء الطلب او ارفضه",
        "request_buyer_success" => "تم ارسال طلب الغاء من قبل المشتري",
        "request_not_found" => "لم يتم ارسال طلب, تفقد بياناتك",
        "request_accepted_by_seller" => "تم قبول طلب الغاء من قبل البائع و تم رفض الخدمة",
        "request_accepted_by_buyer" => "تم قبول طلب الغاء من قبل المشتري و تم رفض الخدمة",
        "request_rejected_by_seller" => "تم رفض طلب الغاء من قبل البائع , سيتم مراسلة الادارة",
        "request_rejected_by_buyer" => "تم رفض طلب الغاء من قبل المشتري , سيتم مراسلة الادارة",
    ]


    
];
